// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//Ракитина Наталья. Урок 3.

//Дописать структуру Complex, добавив метод вычитания комплексных чисел. Продемонстрировать работу структуры.







//Ракитина Наталья. Написать программу «Анкета». Последовательно задаются вопросы (имя, фамилия, возраст, рост, вес).
//Console.WriteLine("Привет Мир");
// Console.ReadLine();


//Console.WriteLine("Анкета");
//Console.WriteLine("Введите Ваше Имя:");

//string name =  Console.ReadLine();
//Console.WriteLine("Введите Вашу Фамилию:");

//string Lastname = Console.ReadLine();

//Console.WriteLine("Введите Ваш Рост:");

//string growth = Console.ReadLine();

//Console.WriteLine("Введите Ваше Вес:");

//string weight = Console.ReadLine();

//Console.WriteLine("ФИО " + name + Lastname + "Рост = " + growth + "Вес = " + weight);
//Console.ReadLine();


//Ввести вес и рост человека. Рассчитать и вывести индекс массы тела (ИМТ) по формуле I=m/(h*h); где m — масса тела в килограммах, h — рост в метрах.

//int m, i, h;
//m = Console.ReadLine();
//Console.WriteLine("Введите Ваш вес:");
//h = Console.ReadLine();
//Console.WriteLine("Введите Ваш рост:");
//i = m / (h*h);
//Console.WriteLine("Индекс массы тела равен:" + i);


